benchmarking/config-comparison-results/go-db-transaction-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test-optimized.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m15s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m45s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-09-10T20:32:46+01:00" level=info msg="Setting up optimized stress test..." source=console
time="2025-09-10T20:32:46+01:00" level=info msg="Note: This test assumes go-db is configured with -transaction-save=false" source=console
time="2025-09-10T20:32:46+01:00" level=info msg="Optimized stress test setup complete" source=console

running (0m01.0s), 002/100 VUs, 11 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m00.9s/1m45.0s

running (0m02.0s), 003/100 VUs, 26 complete and 0 interrupted iterations
default   [   2% ] 003/100 VUs  0m01.9s/1m45.0s

running (0m03.0s), 004/100 VUs, 52 complete and 0 interrupted iterations
default   [   3% ] 004/100 VUs  0m02.9s/1m45.0s

running (0m04.0s), 005/100 VUs, 81 complete and 0 interrupted iterations
default   [   4% ] 005/100 VUs  0m03.9s/1m45.0s

running (0m05.0s), 007/100 VUs, 119 complete and 0 interrupted iterations
default   [   5% ] 007/100 VUs  0m04.9s/1m45.0s

running (0m06.0s), 008/100 VUs, 167 complete and 0 interrupted iterations
default   [   6% ] 008/100 VUs  0m05.9s/1m45.0s

running (0m07.0s), 009/100 VUs, 217 complete and 0 interrupted iterations
default   [   7% ] 009/100 VUs  0m06.9s/1m45.0s

running (0m08.0s), 011/100 VUs, 275 complete and 0 interrupted iterations
default   [   8% ] 011/100 VUs  0m07.9s/1m45.0s

running (0m09.0s), 012/100 VUs, 333 complete and 0 interrupted iterations
default   [   8% ] 012/100 VUs  0m08.9s/1m45.0s

running (0m10.0s), 013/100 VUs, 400 complete and 0 interrupted iterations
default   [   9% ] 013/100 VUs  0m09.9s/1m45.0s

running (0m11.0s), 014/100 VUs, 460 complete and 0 interrupted iterations
default   [  10% ] 014/100 VUs  0m10.9s/1m45.0s

running (0m12.0s), 016/100 VUs, 519 complete and 0 interrupted iterations
default   [  11% ] 016/100 VUs  0m11.9s/1m45.0s

running (0m13.0s), 017/100 VUs, 599 complete and 0 interrupted iterations
default   [  12% ] 017/100 VUs  0m12.9s/1m45.0s

running (0m14.0s), 018/100 VUs, 675 complete and 0 interrupted iterations
default   [  13% ] 018/100 VUs  0m13.9s/1m45.0s

running (0m15.0s), 019/100 VUs, 761 complete and 0 interrupted iterations
default   [  14% ] 019/100 VUs  0m14.9s/1m45.0s

running (0m16.0s), 021/100 VUs, 845 complete and 0 interrupted iterations
default   [  15% ] 021/100 VUs  0m15.9s/1m45.0s

running (0m17.0s), 023/100 VUs, 915 complete and 0 interrupted iterations
default   [  16% ] 023/100 VUs  0m16.9s/1m45.0s

running (0m18.0s), 025/100 VUs, 1003 complete and 0 interrupted iterations
default   [  17% ] 025/100 VUs  0m17.9s/1m45.0s

running (0m19.0s), 027/100 VUs, 1091 complete and 0 interrupted iterations
default   [  18% ] 027/100 VUs  0m18.9s/1m45.0s

running (0m20.0s), 029/100 VUs, 1191 complete and 0 interrupted iterations
default   [  19% ] 029/100 VUs  0m19.9s/1m45.0s

running (0m21.0s), 031/100 VUs, 1280 complete and 0 interrupted iterations
default   [  20% ] 031/100 VUs  0m20.9s/1m45.0s

running (0m22.0s), 033/100 VUs, 1368 complete and 0 interrupted iterations
default   [  21% ] 033/100 VUs  0m21.9s/1m45.0s

running (0m23.0s), 035/100 VUs, 1459 complete and 0 interrupted iterations
default   [  22% ] 035/100 VUs  0m22.9s/1m45.0s

running (0m24.0s), 037/100 VUs, 1553 complete and 0 interrupted iterations
default   [  23% ] 037/100 VUs  0m23.9s/1m45.0s

running (0m25.0s), 039/100 VUs, 1627 complete and 0 interrupted iterations
default   [  24% ] 039/100 VUs  0m24.9s/1m45.0s

running (0m26.0s), 041/100 VUs, 1724 complete and 0 interrupted iterations
default   [  25% ] 041/100 VUs  0m25.9s/1m45.0s

running (0m27.0s), 043/100 VUs, 1793 complete and 0 interrupted iterations
default   [  26% ] 043/100 VUs  0m26.9s/1m45.0s

running (0m28.0s), 045/100 VUs, 1893 complete and 0 interrupted iterations
default   [  27% ] 045/100 VUs  0m27.9s/1m45.0s

running (0m29.0s), 047/100 VUs, 1997 complete and 0 interrupted iterations
default   [  28% ] 047/100 VUs  0m28.9s/1m45.0s

running (0m30.0s), 049/100 VUs, 2083 complete and 0 interrupted iterations
default   [  28% ] 049/100 VUs  0m29.9s/1m45.0s

running (0m31.0s), 051/100 VUs, 2123 complete and 0 interrupted iterations
default   [  29% ] 051/100 VUs  0m30.9s/1m45.0s

running (0m32.0s), 053/100 VUs, 2175 complete and 0 interrupted iterations
default   [  30% ] 053/100 VUs  0m31.9s/1m45.0s

running (0m33.0s), 054/100 VUs, 2257 complete and 0 interrupted iterations
default   [  31% ] 054/100 VUs  0m32.9s/1m45.0s

running (0m34.0s), 056/100 VUs, 2373 complete and 0 interrupted iterations
default   [  32% ] 056/100 VUs  0m33.9s/1m45.0s

running (0m35.0s), 058/100 VUs, 2435 complete and 0 interrupted iterations
default   [  33% ] 058/100 VUs  0m34.9s/1m45.0s

running (0m36.0s), 059/100 VUs, 2522 complete and 0 interrupted iterations
default   [  34% ] 059/100 VUs  0m35.9s/1m45.0s

running (0m37.0s), 061/100 VUs, 2612 complete and 0 interrupted iterations
default   [  35% ] 061/100 VUs  0m36.9s/1m45.0s

running (0m38.0s), 063/100 VUs, 2720 complete and 0 interrupted iterations
default   [  36% ] 063/100 VUs  0m37.9s/1m45.0s

running (0m39.0s), 064/100 VUs, 2838 complete and 0 interrupted iterations
default   [  37% ] 064/100 VUs  0m38.9s/1m45.0s

running (0m40.0s), 066/100 VUs, 2937 complete and 0 interrupted iterations
default   [  38% ] 066/100 VUs  0m39.9s/1m45.0s

running (0m41.0s), 068/100 VUs, 3017 complete and 0 interrupted iterations
default   [  39% ] 068/100 VUs  0m40.9s/1m45.0s

running (0m42.0s), 069/100 VUs, 3101 complete and 0 interrupted iterations
default   [  40% ] 069/100 VUs  0m41.9s/1m45.0s

running (0m43.0s), 071/100 VUs, 3205 complete and 0 interrupted iterations
default   [  41% ] 071/100 VUs  0m42.9s/1m45.0s

running (0m44.0s), 073/100 VUs, 3308 complete and 0 interrupted iterations
default   [  42% ] 073/100 VUs  0m43.9s/1m45.0s

running (0m45.0s), 074/100 VUs, 3387 complete and 0 interrupted iterations
default   [  43% ] 074/100 VUs  0m44.9s/1m45.0s

running (0m46.0s), 076/100 VUs, 3481 complete and 0 interrupted iterations
default   [  44% ] 076/100 VUs  0m45.9s/1m45.0s

running (0m47.0s), 078/100 VUs, 3559 complete and 0 interrupted iterations
default   [  45% ] 078/100 VUs  0m46.9s/1m45.0s

running (0m48.0s), 079/100 VUs, 3641 complete and 0 interrupted iterations
default   [  46% ] 079/100 VUs  0m47.9s/1m45.0s

running (0m49.0s), 081/100 VUs, 3718 complete and 0 interrupted iterations
default   [  47% ] 081/100 VUs  0m48.9s/1m45.0s

running (0m50.0s), 083/100 VUs, 3800 complete and 0 interrupted iterations
default   [  48% ] 083/100 VUs  0m49.9s/1m45.0s

running (0m51.0s), 084/100 VUs, 3877 complete and 0 interrupted iterations
default   [  48% ] 084/100 VUs  0m50.9s/1m45.0s

running (0m52.0s), 086/100 VUs, 3974 complete and 0 interrupted iterations
default   [  49% ] 086/100 VUs  0m51.9s/1m45.0s

running (0m53.0s), 088/100 VUs, 4058 complete and 0 interrupted iterations
default   [  50% ] 088/100 VUs  0m52.9s/1m45.0s

running (0m54.0s), 089/100 VUs, 4156 complete and 0 interrupted iterations
default   [  51% ] 089/100 VUs  0m53.9s/1m45.0s

running (0m55.0s), 091/100 VUs, 4228 complete and 0 interrupted iterations
default   [  52% ] 091/100 VUs  0m54.9s/1m45.0s

running (0m56.0s), 093/100 VUs, 4309 complete and 0 interrupted iterations
default   [  53% ] 093/100 VUs  0m55.9s/1m45.0s

running (0m57.0s), 094/100 VUs, 4384 complete and 0 interrupted iterations
default   [  54% ] 094/100 VUs  0m56.9s/1m45.0s

running (0m58.0s), 096/100 VUs, 4479 complete and 0 interrupted iterations
default   [  55% ] 096/100 VUs  0m57.9s/1m45.0s

running (0m59.0s), 098/100 VUs, 4560 complete and 0 interrupted iterations
default   [  56% ] 098/100 VUs  0m58.9s/1m45.0s

running (1m00.0s), 099/100 VUs, 4643 complete and 0 interrupted iterations
default   [  57% ] 099/100 VUs  0m59.9s/1m45.0s

running (1m01.0s), 100/100 VUs, 4711 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m00.9s/1m45.0s

running (1m02.0s), 100/100 VUs, 4794 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m01.9s/1m45.0s

running (1m03.0s), 100/100 VUs, 4857 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m02.9s/1m45.0s

running (1m04.0s), 100/100 VUs, 4918 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m03.9s/1m45.0s

running (1m05.0s), 100/100 VUs, 4965 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m04.9s/1m45.0s

running (1m06.0s), 100/100 VUs, 5071 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m05.9s/1m45.0s

running (1m07.0s), 100/100 VUs, 5142 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m06.9s/1m45.0s

running (1m08.0s), 100/100 VUs, 5209 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m07.9s/1m45.0s

running (1m09.0s), 100/100 VUs, 5305 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m08.9s/1m45.0s

running (1m10.0s), 100/100 VUs, 5353 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m09.9s/1m45.0s

running (1m11.0s), 100/100 VUs, 5423 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m10.9s/1m45.0s

running (1m12.0s), 100/100 VUs, 5496 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m11.9s/1m45.0s

running (1m13.0s), 100/100 VUs, 5556 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m12.9s/1m45.0s

running (1m14.0s), 100/100 VUs, 5631 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m13.9s/1m45.0s

running (1m15.0s), 100/100 VUs, 5694 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m14.9s/1m45.0s

running (1m16.0s), 100/100 VUs, 5755 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m15.9s/1m45.0s

running (1m17.0s), 100/100 VUs, 5838 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m16.9s/1m45.0s

running (1m18.0s), 100/100 VUs, 5928 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m17.9s/1m45.0s

running (1m19.0s), 100/100 VUs, 5991 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m18.9s/1m45.0s

running (1m20.0s), 100/100 VUs, 6066 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m19.9s/1m45.0s

running (1m21.0s), 100/100 VUs, 6124 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m20.9s/1m45.0s

running (1m22.0s), 100/100 VUs, 6177 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m21.9s/1m45.0s

running (1m23.0s), 100/100 VUs, 6257 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m22.9s/1m45.0s

running (1m24.0s), 100/100 VUs, 6313 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m23.9s/1m45.0s

running (1m25.0s), 100/100 VUs, 6370 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m24.9s/1m45.0s

running (1m26.0s), 100/100 VUs, 6417 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m25.9s/1m45.0s

running (1m27.0s), 100/100 VUs, 6487 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m26.9s/1m45.0s

running (1m28.0s), 100/100 VUs, 6556 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m27.9s/1m45.0s

running (1m29.0s), 100/100 VUs, 6636 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m28.9s/1m45.0s

running (1m30.0s), 100/100 VUs, 6712 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  1m29.9s/1m45.0s

running (1m31.0s), 100/100 VUs, 6787 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  1m30.9s/1m45.0s

running (1m32.0s), 096/100 VUs, 6855 complete and 0 interrupted iterations
default   [  88% ] 096/100 VUs  1m31.9s/1m45.0s

running (1m33.0s), 090/100 VUs, 6888 complete and 0 interrupted iterations
default   [  88% ] 090/100 VUs  1m32.9s/1m45.0s

running (1m34.0s), 086/100 VUs, 6933 complete and 0 interrupted iterations
default   [  89% ] 086/100 VUs  1m33.9s/1m45.0s

running (1m35.0s), 081/100 VUs, 6999 complete and 0 interrupted iterations
default   [  90% ] 081/100 VUs  1m34.9s/1m45.0s

running (1m36.0s), 072/100 VUs, 7076 complete and 0 interrupted iterations
default   [  91% ] 072/100 VUs  1m35.9s/1m45.0s

running (1m37.0s), 064/100 VUs, 7116 complete and 0 interrupted iterations
default   [  92% ] 064/100 VUs  1m36.9s/1m45.0s

running (1m38.0s), 058/100 VUs, 7161 complete and 0 interrupted iterations
default   [  93% ] 058/100 VUs  1m37.9s/1m45.0s

running (1m39.0s), 048/100 VUs, 7212 complete and 0 interrupted iterations
default   [  94% ] 048/100 VUs  1m38.9s/1m45.0s

running (1m40.0s), 040/100 VUs, 7260 complete and 0 interrupted iterations
default   [  95% ] 040/100 VUs  1m39.9s/1m45.0s

running (1m41.0s), 032/100 VUs, 7320 complete and 0 interrupted iterations
default   [  96% ] 032/100 VUs  1m40.9s/1m45.0s

running (1m42.0s), 024/100 VUs, 7357 complete and 0 interrupted iterations
default   [  97% ] 024/100 VUs  1m41.9s/1m45.0s

running (1m43.0s), 016/100 VUs, 7391 complete and 0 interrupted iterations
default   [  98% ] 016/100 VUs  1m42.9s/1m45.0s

running (1m44.0s), 011/100 VUs, 7426 complete and 0 interrupted iterations
default   [  99% ] 011/100 VUs  1m43.9s/1m45.0s

running (1m45.0s), 001/100 VUs, 7458 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  1m44.9s/1m45.0s
time="2025-09-10T20:34:31+01:00" level=info msg="Optimized stress test teardown complete" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<500' p(95)=3.46s

    http_req_failed
    ✓ 'rate<0.01' rate=0.02%


  █ TOTAL RESULTS 

    checks_total.......: 7460    70.804323/s
    checks_succeeded...: 100.00% 7460 out of 7460
    checks_failed......: 0.00%   0 out of 7460

    ✓ stress find status is 200
    ✓ stress update status is 200 or 404
    ✓ stress batch insert status is 201
    ✓ stress get by id status is 200 or 404
    ✓ stress insert status is 201

    CUSTOM
    errors.........................: 0.00%  0 out of 0

    HTTP
    http_req_duration..............: avg=805.39ms min=1.56ms med=104.08ms max=6.06s p(90)=2.75s p(95)=3.46s
      { expected_response:true }...: avg=805.6ms  min=1.56ms med=104.11ms max=6.06s p(90)=2.75s p(95)=3.46s
    http_req_failed................: 0.02%  2 out of 7463
    http_reqs......................: 7463   70.832796/s

    EXECUTION
    iteration_duration.............: avg=906.07ms min=7.97ms med=250.73ms max=6.19s p(90)=2.86s p(95)=3.56s
    iterations.....................: 7460   70.804323/s
    vus............................: 1      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 9.6 MB 92 kB/s
    data_sent......................: 2.6 MB 25 kB/s



running (1m45.4s), 000/100 VUs, 7460 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m45s
time="2025-09-10T20:34:32+01:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"